/**
 * Домашнее задание №1 "Введение в javaScript"
 * @author Korenchuk Dmitriy
 */





// Задание №1
// Запрос имени пользователя ответ в консоль
//  let user = prompt('Назовите себя');
//  console.log(user)


// // Используя alert
//  let user = prompt('Назовите себя');
//  alert("Привет, " + user + "!")

// //Задание №2
// //Запрос года рождения и вычисление возраста пользователя
// let year = prompt("Укажите год вашего рождения")
// let age = (2022 - year)
// console.log("Вам " + age +" лет")

// // Используя alert
// let year = prompt("Укажите год вашего рождения")
// const current = 2022
// let age = (current - year)
// alert("Вам " + age + " лет")

//Задание №3
//Запрос длинны стороны квадрата и расчёт периметра
// let lenght = prompt("Укажите длинну стороны квадрата в сантиметрах")
// let perim = lenght * 4
// console.log("Периметр квадрата = " + perim + " см")

//Задание №4
//Запрос радиуса окружности и расчёт площади окружности
// let radius = prompt("Укажите радиус круга в сантиметрах")
// const  p = 3.14
// let area = p * radius**2
// console.log("Площадь квадрата = " + area + " см2") // не понял как в  сообщении указать сантиметры в квадрате

//Задание №5

